GopalSaraf/Practicals/PSDL/include/proc/pic18f47k42.inc
#define U2RUNOVF                         BANKMASK(U2CON2), 7, b
#define U2RXBE                           BANKMASK(U2FIFO), 1, b
#define U2RXBF                           BANKMASK(U2FIFO), 0, b
#define U2RXBIMD                         BANKMASK(U2CON1), 3, b
#define U2RXBKIE                         BANKMASK(U2ERRIE), 2, b
#define U2RXBKIF                         BANKMASK(U2ERRIR), 2, b
#define U2RXEN                           BANKMASK(U2CON0), 4, b
#define U2RXFOIE                         BANKMASK(U2ERRIE), 1, b
#define U2RXFOIF                         BANKMASK(U2ERRIR), 1, b
#define U2RXIDL                          BANKMASK(U2FIFO), 3, b
#define U2RXIE                           BANKMASK(PIE6), 2, b
#define U2RXIF                           BANKMASK(PIR6), 2, b
#define U2RXIP                           BANKMASK(IPR6), 2, b
#define U2RXPOL                          BANKMASK(U2CON2), 6, b
#define U2SENDB                          BANKMASK(U2CON1), 0, b
#define U2STP0                           BANKMASK(U2CON2), 4, b
#define U2STP1                           BANKMASK(U2CON2), 5, b
#define U2STPMD                          BANKMASK(U2FIFO), 6, b
#define U2TXBE                           BANKMASK(U2FIFO), 5, b
#define U2TXBF                           BANKMASK(U2FIFO), 4, b
#define U2TXCIE                          BANKMASK(U2ERRIE), 0, b
#define U2TXCIF                          BANKMASK(U2ERRIR), 0, b
#define U2TXEN                           BANKMASK(U2CON0), 5, b
#define U2TXIE                           BANKMASK(PIE6), 3, b
#define U2TXIF                           BANKMASK(PIR6), 3, b
#define U2TXIP                           BANKMASK(IPR6), 3, b
#define U2TXMTIE                         BANKMASK(U2ERRIE), 7, b
#define U2TXMTIF                         BANKMASK(U2ERRIR), 7, b
#define U2TXPOL                          BANKMASK(U2CON2), 2, b
#define U2TXWRE                          BANKMASK(U2FIFO), 7, b
#define U2WUE                            BANKMASK(U2CON1), 4, b
#define U2WUIF                           BANKMASK(U2UIR), 7, b
#define U2XON                            BANKMASK(U2FIFO), 2, b
#define UTH0                             BANKMASK(ADUTHL), 0, b
#define UTH1                             BANKMASK(ADUTHL), 1, b
#define UTH10                            BANKMASK(ADUTHH), 2, b
#define UTH11                            BANKMASK(ADUTHH), 3, b
#define UTH12                            BANKMASK(ADUTHH), 4, b
#define UTH13                            BANKMASK(ADUTHH), 5, b
#define UTH14                            BANKMASK(ADUTHH), 6, b
#define UTH15                            BANKMASK(ADUTHH), 7, b
#define UTH2                             BANKMASK(ADUTHL), 2, b
#define UTH3                             BANKMASK(ADUTHL), 3, b
#define UTH4                             BANKMASK(ADUTHL), 4, b
#define UTH5                             BANKMASK(ADUTHL), 5, b
#define UTH6                             BANKMASK(ADUTHL), 6, b
#define UTH7                             BANKMASK(ADUTHL), 7, b
#define UTH8                             BANKMASK(ADUTHH), 0, b
#define UTH9                             BANKMASK(ADUTHH), 1, b
#define UTHR                             BANKMASK(ADSTAT), 6, b
#define VREGPM                           BANKMASK(VREGCON), 1, b
#define WDTCS0                           BANKMASK(WDTCON1), 4, b
#define WDTCS1                           BANKMASK(WDTCON1), 5, b
#define WDTCS2                           BANKMASK(WDTCON1), 6, b
#define WDTPS0                           BANKMASK(WDTCON0), 1, b
#define WDTPS1                           BANKMASK(WDTCON0), 2, b
#define WDTPS2                           BANKMASK(WDTCON0), 3, b
#define WDTPS3                           BANKMASK(WDTCON0), 4, b
#define WDTPS4                           BANKMASK(WDTCON0), 5, b
#define WDTPSCNT0                        BANKMASK(WDTPSL), 0, b
#define WDTPSCNT1                        BANKMASK(WDTPSL), 1, b
#define WDTPSCNT10                       BANKMASK(WDTPSH), 2, b
#define WDTPSCNT11                       BANKMASK(WDTPSH), 3, b
#define WDTPSCNT12                       BANKMASK(WDTPSH), 4, b
#define WDTPSCNT13                       BANKMASK(WDTPSH), 5, b
#define WDTPSCNT14                       BANKMASK(WDTPSH), 6, b
#define WDTPSCNT15                       BANKMASK(WDTPSH), 7, b
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0, b
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1, b
#define WDTPSCNT2                        BANKMASK(WDTPSL), 2, b
#define WDTPSCNT3                        BANKMASK(WDTPSL), 3, b
#define WDTPSCNT4                        BANKMASK(WDTPSL), 4, b
#define WDTPSCNT5                        BANKMASK(WDTPSL), 5, b
#define WDTPSCNT6                        BANKMASK(WDTPSL), 6, b
#define WDTPSCNT7                        BANKMASK(WDTPSL), 7, b
#define WDTPSCNT8                        BANKMASK(WDTPSH), 0, b
#define WDTPSCNT9                        BANKMASK(WDTPSH), 1, b
#define WDTSEN                           BANKMASK(WDTCON0), 0, b
#define WDTSTATE                         BANKMASK(WDTTMR), 2, b
#define WDTTMR0                          BANKMASK(WDTTMR), 3, b
#define WDTTMR1                          BANKMASK(WDTTMR), 4, b
#define WDTTMR2                          BANKMASK(WDTTMR), 5, b
#define WDTTMR3                          BANKMASK(WDTTMR), 6, b
#define WDTTMR4                          BANKMASK(WDTTMR), 7, b
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0, b
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1, b
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2, b
#define WDTWV                            BANKMASK(PCON0), 5, a
#define WINDOW0                          BANKMASK(WDTCON1), 0, b
#define WINDOW1                          BANKMASK(WDTCON1), 1, b
#define WINDOW2                          BANKMASK(WDTCON1), 2, b
#define WPOL                             BANKMASK(SMT1CON0), 4, b
#define WPUA0                            BANKMASK(WPUA), 0, b
#define WPUA1                            BANKMASK(WPUA), 1, b
#define WPUA2                            BANKMASK(WPUA), 2, b
#define WPUA3                            BANKMASK(WPUA), 3, b
#define WPUA4                            BANKMASK(WPUA), 4, b
#define WPUA5                            BANKMASK(WPUA), 5, b
#define WPUA6                            BANKMASK(WPUA), 6, b
#define WPUA7                            BANKMASK(WPUA), 7, b
#define WPUB0                            BANKMASK(WPUB), 0, b
#define WPUB1                            BANKMASK(WPUB), 1, b
#define WPUB2                            BANKMASK(WPUB), 2, b
#define WPUB3                            BANKMASK(WPUB), 3, b
#define WPUB4                            BANKMASK(WPUB), 4, b
#define WPUB5                            BANKMASK(WPUB), 5, b
#define WPUB6                            BANKMASK(WPUB), 6, b
#define WPUB7                            BANKMASK(WPUB), 7, b
#define WPUC0                            BANKMASK(WPUC), 0, b
#define WPUC1                            BANKMASK(WPUC), 1, b
#define WPUC2                            BANKMASK(WPUC), 2, b
#define WPUC3                            BANKMASK(WPUC), 3, b
#define WPUC4                            BANKMASK(WPUC), 4, b
#define WPUC5                            BANKMASK(WPUC), 5, b
#define WPUC6                            BANKMASK(WPUC), 6, b
#define WPUC7                            BANKMASK(WPUC), 7, b
#define WPUD0                            BANKMASK(WPUD), 0, b
#define WPUD1                            BANKMASK(WPUD), 1, b
#define WPUD2                            BANKMASK(WPUD), 2, b
#define WPUD3                            BANKMASK(WPUD), 3, b
#define WPUD4                            BANKMASK(WPUD), 4, b
#define WPUD5                            BANKMASK(WPUD), 5, b
#define WPUD6                            BANKMASK(WPUD), 6, b
#define WPUD7                            BANKMASK(WPUD), 7, b
#define WPUE0                            BANKMASK(WPUE), 0, b
#define WPUE1                            BANKMASK(WPUE), 1, b
#define WPUE2                            BANKMASK(WPUE), 2, b
#define WPUE3                            BANKMASK(WPUE), 3, b
#define WR                               BANKMASK(NVMCON1), 1, b
#define WR1IE                            BANKMASK(I2C1PIE), 4, b
#define WR1IF                            BANKMASK(I2C1PIR), 4, b
#define WR2IE                            BANKMASK(I2C2PIE), 4, b
#define WR2IF                            BANKMASK(I2C2PIR), 4, b
#define WREN                             BANKMASK(NVMCON1), 2, b
#define WRERR                            BANKMASK(NVMCON1), 3, b
#define WS                               BANKMASK(SMT1STAT), 1, b
#define WSEL0                            BANKMASK(SMT1WIN), 0, b
#define WSEL1                            BANKMASK(SMT1WIN), 1, b
#define WSEL2                            BANKMASK(SMT1WIN), 2, b
#define WSEL3                            BANKMASK(SMT1WIN), 3, b
#define WSEL4                            BANKMASK(SMT1WIN), 4, b
#define X1                               BANKMASK(CRCXORL), 1, b
#define X10                              BANKMASK(CRCXORH), 2, b
#define X11                              BANKMASK(CRCXORH), 3, b
#define X12                              BANKMASK(CRCXORH), 4, b
#define X13                              BANKMASK(CRCXORH), 5, b
#define X14                              BANKMASK(CRCXORH), 6, b
#define X15                              BANKMASK(CRCXORH), 7, b
#define X2                               BANKMASK(CRCXORL), 2, b
#define X3                               BANKMASK(CRCXORL), 3, b
#define X4                               BANKMASK(CRCXORL), 4, b
#define X5                               BANKMASK(CRCXORL), 5, b
#define X6                               BANKMASK(CRCXORL), 6, b
#define X7                               BANKMASK(CRCXORL), 7, b
#define X8                               BANKMASK(CRCXORH), 0, b
#define X9                               BANKMASK(CRCXORH), 1, b
#define ZCDIE                            BANKMASK(PIE1), 1, b
#define ZCDIF                            BANKMASK(PIR1), 1, b
#define ZCDINTN                          BANKMASK(ZCDCON), 0, b
#define ZCDINTP                          BANKMASK(ZCDCON), 1, b
#define ZCDIP                            BANKMASK(IPR1), 1, b
#define ZCDMD                            BANKMASK(PMD2), 0, b
#define ZCDOUT                           BANKMASK(ZCDCON), 5, b
#define ZCDPOL                           BANKMASK(ZCDCON), 4, b
#define ZCDSEN                           BANKMASK(ZCDCON), 7, b
#define ZERO                             BANKMASK(STATUS), 2, a
#define nBOR                             BANKMASK(PCON0), 0, a
#define nMEMV                            BANKMASK(PCON1), 1, a
#define nPOR                             BANKMASK(PCON0), 1, a
#define nRI                              BANKMASK(PCON0), 2, a
#define nRMCLR                           BANKMASK(PCON0), 3, a
#define nRWDT                            BANKMASK(PCON0), 4, a
#define nWDTWV                           BANKMASK(PCON0), 5, a

